In [3]:
import pandas as pd
import numpy as np

string_data = pd.DataFrame([None, 'artichoke', NaN, 'avocado'])
string_data

NameError: name 'NaN' is not defined

In [4]:
string_data = pd.DataFrame([None, 'artichoke', np.nan, 'avocado'])
string_data

           0
0       None
1  artichoke
2        NaN
3    avocado

In [5]:
string_data.isnull()

       0
0   True
1  False
2   True
3  False

In [6]:
string_data[0]

0         None
1    artichoke
2          NaN
3      avocado
Name: 0, dtype: object

In [31]:
from numpy import nan as NA
data = pd.DataFrame([[1., 2.5, 5.], [1., NA, NA], [NA, NA, NA], [NA, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [19]:
data.isnull()

       0      1      2
0  False  False  False
1  False   True   True
2   True   True   True
3   True  False  False

In [18]:
dropped = data.dropna()
dropped

     0    1    2
0  1.0  6.5  3.0

In [17]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [22]:
data.dropna(how='all', axis=1)

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [23]:
data.dropna(thresh=2)

     0    1    2
0  1.0  6.5  3.0
3  NaN  6.5  3.0

In [27]:
data.fillna(0)

     0    1    2
0  1.0  6.5  3.0
1  1.0  0.0  0.0
2  0.0  0.0  0.0
3  0.0  6.5  3.0

In [28]:
data.fillna({1:0.5, 2:0})

     0    1    2
0  1.0  6.5  3.0
1  1.0  0.5  0.0
2  NaN  0.5  0.0
3  NaN  6.5  3.0

In [29]:
data.fillna(0, inplace=True)
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  0.0  0.0
2  0.0  0.0  0.0
3  0.0  6.5  3.0

In [9]:
from numpy import nan as NA
data1 = pd.DataFrame([[1., 2.5, 5.], [1., NA, NA], [NA, NA, NA], [NA, 6.5, 3.]])
data1

     0    1    2
0  1.0  2.5  5.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [16]:
data1.mean()

0    1.0
1    4.5
2    4.0
dtype: float64

In [17]:
data1.fillna(data1.mean())

     0    1    2
0  1.0  2.5  5.0
1  1.0  4.5  4.0
2  1.0  4.5  4.0
3  1.0  6.5  3.0

In [11]:
data1.fillna({1:0, 2:data1[2].mean()})

     0    1    2
0  1.0  2.5  5.0
1  1.0  0.0  4.0
2  NaN  0.0  4.0
3  NaN  6.5  3.0